package studio.goldenapp.hr_d;

public class ComputerQuestions {

    public String mQuestions [] = {
            "कंप्यूटर के आविष्कारक कौन हैं ?",
            "सबसे पहला कंप्यूटर का नाम क्या था ?",
            "कम्प्यूटर के क्षेत्र में महान क्रांति कब से आई ?",
            "कंप्यूटर का हिन्दी नाम क्या है ?",
            "कंप्यूटर साक्षरता दिवस कब मनाया जाता है ?",
            "CPU का पूर्ण रूप क्या है ?",
            "इनमें से कौन सर्च इंजन नहीं है ?",
            "निम्न में कौन इनपुट इकाई है ?",
            "1 किलोबाइट (KB) कितने बाइट के बराबर होते है ?",
            "कम्प्यूटरों में प्रयुक्त आई. सी. चिप बनते हैं ?",
            "इन्टरनेट के पते में पद एचटीटीपी का सही विस्तृत रूप है ?",
            "निम्नलिखित में से ऑप्टिकल मेमोरी है ?",
            "CPU में कंट्रोल, मेमोरी और तीसरा कौन सा यूनिट होते हैं ?",
            "CPU के ALU में होते हैं ?",
            "गणना और तुलना के लिए कम्प्यूटर के किस भाग का प्रयोग किया जाता है ?",
            "एक हार्डवेयर डिवाइस जो डाटा को अर्थ पूर्ण इनफार्मेशन में परिवर्तित करता है ?",
            "कम्प्यूटर के सेंट्रल प्रोसैसिंग यूनिट का Function है ?",
            "परिचालन सम्पन्न करता है ?",
            "कम्प्यूटर निम्नलिखित में से कौन-सा कार्य नहीं करता है ?",
            "कंप्यूटर में जाने वाले डेटा को क्या कहते हैं ?",
            "प्रथम गणना यंत्र है ?",
            "पैकमैन नामक प्रसिद्ध कंप्यूटर किस काम के लिए बना था ?",
            "इनमें से कौन सबसे बड़ा, सबसे तेज और सबसे महँगा कंप्यूटर है ?",
            "सामान्य रूप से प्रयुक्त किया जाने वाला कंप्यूटर है ?",
            "CRAY क्या है ?",
            "सबसे तेज कंप्यूटर होता है ?",
            "डिजिटल कंप्यूटर किस सिद्धान्त पर कार्य करता है ?",
            "L.C.D का पूरा नाम क्या होता है ?",
            "कंप्यूटर के मेमोरी में डाले गये कार्य को प्रदर्शित करता है ?",
            "निम्न में से कौन-सा आउटपुट डिवाइस नहीं है ?",
            "पहला कंप्यूटर माउस किसने बनाया था ?",
            "निम्नलिखित में से क्या स्टोरेज डिवाइस का उदाहरण नहीं है ?",
            "डीवीडी (DVD) क्या है ?",
            "डिस्क को पढ़ने के लिए प्रयोग में आने वाला हार्डवेयर है ?",
            "इलेक्ट्रॉनिक कंम्पोनेन्टवाले थिन प्लेट या बोर्ड को कहते हैं ?",
            "एक्सपैंशन कार्ड किसमे इन्सर्ट किए जाते हैं ?",
            "कंप्यूटर की घड़ी की स्पीड की गणना किसमें की जाती है ?",
            "किसका उपयोग करते हुए पहला कंप्यूटर प्रोग्राम किए गए थे ?",
            "किसने बेसिक कंप्यूटर भाषा का विकास किया था ?",
            "बेसिक कंप्यूटर भाषा का विकास कब हुआ था ?",
            "किसी प्रोग्राम का चित्र के रूप में प्रदर्शन क्या कहलाता है ?",
            "निम्नलिखित में से कौन-सी वैज्ञानिक कंप्यूटर भाषा है ?",
            "कंप्यूटर भाषा COBOL किसके लिए उपयोगी है ?",
            "कंप्यूटर में होना चाहिए कि यह ‘बूट हो सके?",
            "एक्सेल में, यह एक प्रीरिकार्डिड फार्मूलों है जो जटिल गणनाओं के लिए शार्टकट है।",
            "………………………… में परिवर्तित(Change) डॉक्यूमेंन्ट्स को वेब पर प्रकाशित(Published) किया जा सकता है ?",
            "SMPS का पूरा नाम क्या है?",
            "निम्न में से कोनसा सबसे तेज और सबसे बड़ा और सबसे अधिक महंगा Computer है?",
            "सर्वाधिक तेज गति वाला प्रिंटर है?",
            "कम्\u200Dप्\u200Dयूटर डाटा स्\u200Dटोर करने और गणनाऍ करने के लिए ……………. नंबर सिस्\u200Dटम का प्रयोग करते है।",
            "वर्तमान पीढ़ी के कंप्यूटर में प्रयोग होते है-",
            "अगली पीढ़ी के कंप्यूटर में प्रयोग किया जाएगा-",
            "विशेष रूप से डिजाइन किए गए कंप्यूटर चिप, जो किसी अन्य डिवाइस के अंदर रहते है , कहलाते है?",
            "कम्प्यूटर हार्डवेयर में जो सिलिका का बना है, आंकड़ों की बहुत अधिक मात्रा को भंडार में रख सकता है।–",
            "डिस्क (disk)की मेन डायरेक्टरी [Main Directory] …………… डायरेक्टरी कहलाती है,",
            "टेक्\u200Dस्\u200Dट की पंक्ति के आरम्\u200Dभ में जाने के लिए ………… की  का प्रयोग करते है।",
            "कम्\u200Dप्\u200Dयूटर को …………. बताता हैं कि इसके कम्\u200Dपोनेंट्स का प्रयोग कैसे किया जाए।",
            "निम्न में से Windows 7 का System icon नहीं है?",
            "इनमें से कौन कंप्यूटर का गुण नही है-",
            "बाइनरी सिस्टम एक नंबर सिस्टम है–" ,
            "एक्सेल में फक्शन कैटेगरी नहीं है–",
            "कम्प्यूटर(computer) के क्षेत्र में .BAS, .DOC, .HTMl किसके(example) उदाहरण है ?",
            "बिलिंग अकाउंट को ट्रैक करने के लिये आप मुख्य रूप से किस प्रकार के साॅफ्टवेयर का प्रयोग करेंगे –",
            "बैंक में Cheque Read करने के लिए निम्न में से कोनसी विधि का प्रयोग होता है?",
            "भारत में विकशित परम Computer का विकास किस संस्था द्वारा किया गया था?",
            "PC पर टाइपिंग करते समय दो शब्\u200Dदों के बीच जगह छोड़ने के लिए ………….. नामक की दबानी पडती है।",
            "………… कुंजी (की) स्\u200Dटार्ट करने को शुरू करती हैं।",
            "संसार का प्रथम प्रोग्रामर माना जाता है-",
            "द्विआधारी पध्दति (Binary System) का प्रयोग करने वाले कंप्यूटर को कहते है-",
            "निम्नलिखित में से कौन एप्लिकेशन (Application )साॅफ्टवेयर( Softwar) का उदाहरण नहीं है ?",
            "निम्\u200Dनलिखित में से स्\u200Dटोरेज का सबसे बड़ा यूनिट कौन – सा हैं",
            "ग्राफ़िक इमेज को कंप्यूटर में किसकी सहायता से इनपुट करते है?",
    };

    private String mChoices [][] = {
            {"वॉन न्यूमेन", "चार्ल्स बैबेज", "जे एस किल्बी", "इनमें से कोई नहीं"},
            {"ENIAC", "ATARIS", "TANDY", "NOVELLA"},
            {"1960", "1990", "1976", "1955"},
            {"गणना करनेवाला", "हिसाब लगानेवाला", "संगणक", "परिगणक"},
            {"20 दिसम्बर", "18 दिसम्बर", "22 दिसम्बर", "2 दिसम्बर"},
            {"Central Problem Unit", "Central Processing Union", "Central Processing Unit", "इनमें से कोई नहीं"},
            {"Google", "Yahoo", "Biadu", "Android"},
            {"Mouse", "RAM", "Cache", "Monitor"},
            {"1024 बाइट", "1024 मेगाबाइट", "1024 गीगाबाइट", "इनमें से कोई नहीं"},
            {"क्रोमियम से", "सिलिकॉन से", "आयरन औकसाइड से", "सिल्वर से"},
            {"higher transfer tex protocol", "hybrid text transfer protocol", "higher text transfer protocol", "hyper text transfer protocol"},
            {"बबल मेमोरीज", "फ्लॉपी डिस्क", "सी डी–रोम", "कोर मेमोरीज"},
            {"माइक्रो", "आउटपुट", "प्रोसेसर", "अर्थमैटिक/लॉजिक"},
            {"RAM स्पेस", "बाइट स्पेस", "रजिस्टर", "इनमें से सभी"},
            {"ALU", "डिस्क यूनिट", "कंट्रोल यूनिट", "मोडम"},
            {"प्रोग्राम", "प्रोसेसर", "मोडम", "इनपुट डिवाइस"},
            {"डेटा डिलीट करता है", "इनवाइस बनाता है", "गणनाएँ और प्रोसैसिंग करता है", "इनमें से कोई नहीं"},
            {"एल्गोरिद्म", "ASCII", "अर्थमैटिक", "माइक्रो"},
            {"प्रोसैसिंग", "अंडरस्टैंडिंग", "इंप्यूटिंग", "आउटपुटिंग"},
            {"एल्गोरिथ्म", "कैलक्युलेशन्स", "आउटपुट", "इनपुट"},
            {"कैलकुलेटर", "अबैकस", "डिफरेंस इंजन", "घड़ी"},
            {"खेल", "पुस्तक प्रकाशन", "शेयर बाजार", "बैंक"},
            {"सुपर कंप्यूटर", "लैपटॉप", "पर्सनल कंप्यूटर", "नोट बुक"},
            {"सुपर कंप्यूटर", "ऑप्टिकल कंप्यूटर", "डिजिटल कंप्यूटर", "हाइब्रिड कंप्यूटर"},
            {"डिजिटल कंप्यूटर", "सुपर कंप्यूटर", "लैपटॉप", "पर्सनल कंप्यूटर"},
            {"डिजिटल कंप्यूटर", "सुपर कंप्यूटर", "हाइब्रिड कंप्यूटर", "ऑप्टिकल कंप्यूटर"},
            {"मापन", "लॉजिकल", "गणना", "विद्युत"},
            {"Lead Crystal Device", "Liquid Central Display", "Light Central Display", "Liquid Crystal Display"},
            {"मॉनिटर", "RAM", "मोडम", "Mouse"},
            {"मॉनिटर", "प्रिन्टर", "प्लॉटर", "टचस्क्रीन"},
            {"वॉन न्यूमेन", "चार्ल्स बैबेज", "डगलस एन्जलबर्ट", "जे एस किल्बी"},
            {"RAM", "फ्लॉपी", "CD", "हार्ड डिस्क"},
            {"डिजिटल वर्सेटाइल डिस्क", "डिजिटल वीडियो डिस्क", "डाइनेमिक वीडियो डिस्क", "डाइनेमिक वर्सेटाइल डिस्क"},
            {"CPU", "RAM", "Disc Drive", "Cache"},
            {"हार्ड डिस्क", "RAM", "ROM", "सर्किट बोर्ड"},
            {"CPU", "स्लॉट", "पेग्स", "पेरिफेरल डिवाइस"},
            {"बिट", "मेगाबाइट", "गीगाबाइट", "इनमें से कोई नहीं"},
            {"मशीन लैंग्वेज", "सोर्स कार्ड", "ओब्जेक्ट कार्ड", "एसेंबिल लैंग्वेज"},
            {"निकोलस बर्थ", "जिम क्लार्क", "डगलस एन्जलबर्ट", "जॉन. जी. कैमी"},
            {"1955", "1961", "1964", "1969"},
            {"मिक्स चार्ट", "फ्लोचार्ट", "चार्ट", "हल चार्ट"},
            {"COBOL", "BASIC", "PASCAL", "FORTRAN"},
            {"ग्राफिक कार्य", "व्यावसायिक कार्य", "वैज्ञानिक कार्य", "इनमें से कोई नहीं"},
            {"कम्पाइलर", "लोडर", "ऑपरेटिंग सिस्टम", "एसेम्बलर"},
            {"वैल्यू", "डाटा सीरीज", "फंक्शन", "फील्ड"},
            {"DOC फाईल", "मशीन (machine)लैन्गुएज", "HTTP files", "दिए गए विकल्पों के अलावा"},
            {"सर्विस मेक्ट पॉवर शाप", "स्विचड मोडपावर सप्लाई", "मैन पावर सप्लाई", "सेव पावर मैन सप्लाई"},
            {"Super Computer", "Desktop Computer", "Server", "Laptop"},
            {"Jet Printer", "Tharmal Printer", "Laser Printer", "Daisy Wheel Printer"},
            {"दशमलव", "हेक्\u200Dसाडेसिमल", "ओक्\u200Dटल", "बाइनरी"},
            {"SSIC", "MSIC", "VLSIC", "ULSIC"},
            {"BI", "AI", "DI", "SI"},
            {"सर्वर", "चिप", "रोबोट कंप्यूटर", "एम्बेडेड कंप्यूटर"},
            {"डिस्क", "चिप", "मैग्नेटिक टेप", "फाइल"},
            {"home", "etc", "dev", "root"},
            {"होम", "इंड", "पेजअप", "एंटर"},
            {"application programming", "network", "kernal", "web socket"},
            {"Recycle Bin", "Computer", "MS Word", "Network"},
            {"जल्द निर्णय लेने की क्षमता", "गोपनीयता", "विविधता", "बुद्धिहिन"},
            {"2", "4", "8", "10"},
            {"लॉजिकल", "डाटा सीरीज", "फाइनैंशियल", "टेक्स्ट"},
            {"एक्सटेंशंस", "प्रोटोकॉल्स", "डाटाबेस", "दिये गये विकल्पों में कोई नहीं"},
            {"वेब ऑथरिंग", "वर्ड प्रोसेसिंग", "स्प्रेडशीड", "इलेक्ट्रानिक्स पब्लिशिंग"},
            {"OCR", "MCR", "MICR", "OMR"},
            {"C-ADC", "IIT Mumbai", "IIT Delhi", "BARC"},
            {"बैक स्\u200Dपेश", "शिफ्ट", "कंट्रोल", "स्\u200Dपेश बार"},
            {"इस्\u200Dकेप", "शिफ्ट", "शॉर्टकट", "विंडोज"},
            {"चार्ल्स बैबेज", "एप्पल कंपनी", "लेडी एडा आगस्टा", "आई बी एम कंपनी"},
            {"एनालॉग कंप्यूटर", "डिजिटल कंप्यूटर", "हाइब्रिड कंप्यूटर", "इनमे से कोई नही"},
            {"डाटाबेस(database)साफ्टवेयर", "वर्ड प्रोसेसिंग साफ्टवेय", "आपरेटिंग सिस्टम", "ग्राफिक्स साफ्टवेयर"},
            {"TB", "GB", "KB", "MB"},
            {"स्कैनर", "फ्लोपी", "जॉयस्टिक", "माउस"},
    };

    private String mCorrectAnswers[] = {"चार्ल्स बैबेज","ENIAC","1960","संगणक","2 दिसम्बर","Central Processing Unit","Android",
            "Mouse","1024 बाइट","सिलिकॉन से","hyper text transfer protocol","सी डी–रोम","अर्थमैटिक/लॉजिक","रजिस्टर","ALU","प्रोसेसर","गणनाएँ और प्रोसैसिंग करता है",
            "अर्थमैटिक","अंडरस्टैंडिंग","इनपुट","अबैकस","खेल","सुपर कंप्यूटर","डिजिटल कंप्यूटर","सुपर कंप्यूटर","सुपर कंप्यूटर","गणना","Liquid Crystal Display","मॉनिटर",
            "टचस्क्रीन","डगलस एन्जलबर्ट","RAM","डिजिटल वीडियो डिस्क","Disc Drive","सर्किट बोर्ड","स्लॉट","बिट","मशीन लैंग्वेज",
            "जॉन. जी. कैमी","1964","फ्लोचार्ट","FORTRAN","व्यावसायिक कार्य","ऑपरेटिंग सिस्टम","फंक्शन","HTTP files","स्विचड मोडपावर सप्लाई",
            "Super Computer","Laser Printer","बाइनरी","ULSIC","AI","एम्बेडेड कंप्यूटर","चिप","root","होम","application programming",
            "Network","बुद्धिहिन","2","डाटा सीरीज","एक्सटेंशंस","स्प्रेडशीड","MICR","C-ADC","स्\u200Dपेश बार","विंडोज","लेडी एडा आगस्टा","डिजिटल कंप्यूटर",
            "आपरेटिंग सिस्टम", "TB", "स्कैनर"
    };




    public String getQuestion(int a) {
        String question = mQuestions[a];
        return question;
    }


    public String getChoice1(int a) {
        String choice0 = mChoices[a][0];
        return choice0;
    }


    public String getChoice2(int a) {
        String choice1 = mChoices[a][1];
        return choice1;
    }

    public String getChoice3(int a) {
        String choice2 = mChoices[a][2];
        return choice2;
    }

    public String getChoice4(int a) {
        String choice3 = mChoices[a][3];
        return choice3;
    }

    public String getCorrectAnswer(int a) {
        String answer = mCorrectAnswers[a];
        return answer;
    }

}
