package studio.goldenapp.hr_d;

public class CurrentAffairQuestions {

        public String mQuestions [] = {
                "भारत में रेल का आरम्भ किस सन में हुआ?",
                "भारतीय रेल का राष्ट्रीयकरण कब हुआ?",
                "भारत में सबसे लंबी दूरी तय करने वाली रेल कौन सी है?",
                "भारत में सबसे तेज़ चलनेवाली गाड़ी कौन सी है?",
                "रेल इन्जिन के आविष्कारक कौन हैं?",
                "रेलवे बोर्ड की स्थापना कब की गयी ?",
                "भारत की प्रथम रेलगाड़ी द्वारा कितनी दूरी तय की गयी?",
                "भारत में पहली बार मेट्रो रेल सेवा किस नगर में आरम्भ की गई?",
                "सबसे लंबी रेलवे प्लेटफॉर्म कहाँ है?",
                "भारत के किस राज्य में रेलवे लाइन नहीं है?",
                "स्वतन्त्र भारत का पहला रेल बजट किन्होंने प्रस्तुत किया था?",
                "भारतीय रेल का स्लोगन क्या है?",
                "भारतीय रेलवे का रेल लाइन की लम्बाई की दृष्टि से विश्व में कौनसा स्थान है?",
                "भारत में रेल लाइन बिछाने का श्रेय किसे प्राप्त है?",
                "भारत में सबसे पहली ट्रेन कहाँ चली थी?",
                "रेलवे बजट को सामान्य बजट से किस वर्ष अलग किया गया?",
                "भारतीय रेल नेटवर्क का एशिया में कौन-सा स्थान है ?",
                "विश्व में प्रथम रेल कब चली ?",
                "भारत के किस राज्य में रेल लाइन सबसे अधिक है ?",
                "पूर्व सेन्ट्रल रेलवे जोन का मुख्यालय है ?",
                "निम्नलिखित में से कहाँ रेलवे मुख्यालय नहीं है ?",
                "पहिए और एक्सिल बनाने वाली रेलवे यूनिट कहाँ अवस्थित है ?",
                "भारत में प्रथम विद्युत् ट्रेन कब चली ?",
                "रेलवे का जोन मुख्यालय हाजीपुर स्थित है ?",
                "भारत में सर्वप्रथम रेल किन स्टेशनों के मध्य चली ?",
                "केंद्र सरकार द्वारा शुरू की गई \"सुशासन एक्सप्रेस\" किन दो शहरों के मध्य चलेगी?",
                "9 नवंबर 2017 को भारत और बांग्लादेश के मध्य कौन-सी नई ट्रेन की सेवा शुरुआत हुआ ?",

        };


        private String mChoices [][] = {
                {"1953", "1853", "1865", "1858"},
                {"1950", "1965", "1935", "1955"},
                {"राजधानी एक्सप्रेस", "शताब्दी एक्सप्रेस", "विवेक एक्सप्रेस", "समझौता एक्सप्रेस"},
                {"राजधानी एक्सप्रेस", "समझौता एक्सप्रेस", "विवेक एक्सप्रेस", "शताब्दी एक्सप्रेस"},
                {"जॉर्ज ऑरेवल", "अब्दुल गफ्फार खान", "जॉर्ज स्टीफेंसन", "अन्य"},
                {"1905", "1950", "1933", "1853"},
                {"44 किमी", "34 किमी", "40 किमी", "48 किमी"},
                {"कोलकाता", "गोरखपुर", "दिल्ली", "मुंबई"},
                {"कोलकाता", "गोरखपुर", "दिल्ली", "मुंबई"},
                {"मेघालय", "तेलंगाना", "ओडिशा", "अन्य"},
                {"अब्दुल रहीम", "अब्दुल गफ्फार खान", "जॉर्ज ऑरेवल", "जॉन मथाई"},
                {"राष्ट्र की जीवन रेखा", "राष्ट्र की कार्रवाई सड़क", "राष्ट् सेवा की रोड", "अन्य"},
                {"तीसरा", "छटा", "सातवाँ", "चौथा"},
                {"जॉन मथाई", "जॉर्ज ऑरेवल", "जॉर्ज स्टीफेंसन", "लार्ड डलहौजी"},
                {"कोलकाता", "दिल्ली", "मुंबई", "गोरखपुर"},
                {"1899", "1997", "1924", "1928"},
                {"तीसरा", "दूसरा", "सातवाँ", "चौथा"},
                {"1825", "1857", "1822", "1809"},
                {"उत्तर प्रदेश", "महाराष्ट्र", "राजस्थान", "हरियाणा"},
                {"हाजीपुर", "गया", "राँची", "पटना"},
                {"हुबली", "बिलासपुर", "अहमदाबाद", "हाजीपुर"},
                {"बंगलौर", "कानपुर", "चित्तरंजन", "चेन्नई"},
                {"1950", "1925", "1929", "1935"},
                {"छत्तीसगढ़", "झारखण्ड", "उत्तर प्रदेश", "बिहार"},
                {"मुम्बई - दिल्ली", "मुम्बई - थाणे", "मुम्बई - पुणे", "दिल्ली - थाणे"},
                {"ग्वालियर और लखनऊ", "वालियर और इंदौर", "ग्वालियर और हजरत निजामुद्दीन", "ग्वालियर और गोंडा"},
                {"बांग्लादेश एक्सप्रेस", "बंधन एक्सप्रेस", "गतिमान एक्सप्रेस", "महाराजा एक्सप्रेस"},
        };



        private String mCorrectAnswers[] = {"1853", "1950","विवेक एक्सप्रेस", "शताब्दी एक्सप्रेस","जॉर्ज स्टीफेंसन", "1905","34 किमी", "कोलकाता"
                ,"गोरखपुर", "मेघालय","जॉन मथाई", "राष्ट्र की जीवन रेखा","चौथा", "लार्ड डलहौजी","मुंबई", "1924","दूसरा", "1825"
                ,"उत्तर प्रदेश", "हाजीपुर","अहमदाबाद", "बंगलौर","1925", "बिहार","मुम्बई - थाणे", "ग्वालियर और गोंडा", "बंधन एक्सप्रेस"};




        public String getQuestion(int a) {
            String question = mQuestions[a];
            return question;
        }


        public String getChoice1(int a) {
            String choice0 = mChoices[a][0];
            return choice0;
        }


        public String getChoice2(int a) {
            String choice1 = mChoices[a][1];
            return choice1;
        }

        public String getChoice3(int a) {
            String choice2 = mChoices[a][2];
            return choice2;
        }

        public String getChoice4(int a) {
            String choice3 = mChoices[a][3];
            return choice3;
        }

        public String getCorrectAnswer(int a) {
            String answer = mCorrectAnswers[a];
            return answer;
        }

}
