package studio.goldenapp.hr_d;

public class HgkQuestions {

    public String mQuestions [] = {
            "प्राचीन काल में हरियाणा राज्य अन्य किस नाम से जाना जाता था ?",
            "हरियाणा का स्थापना दिवस कब है ?",
            "हरियाणा में कितने जिले है ?",
            "हरियाणा में उप-मण्डल है ?",
            "हरियाणा का प्रथम राजयपाल ?",
            "हरियाणा का प्रथम मुख्यमंत्री ?",
            "क्षेत्रफल की दृष्टि से भारत में हरियाणा का स्थान है ?",
            "हरियाणा का सर्वाधिक क्षेत्रफल वाला जिला है ?",
            "हरियाणा का सबसे अधिक जनसंख्या वाला जिला है ?",
            "हरियाणा का सबसे कम जनसंख्या वाला जिला है ?",
            "जनसंख्या की दृष्टि से भारत में हरियाणा का स्थान है ?",
            "हरियाणा का राजकीय खेल है ?",
            "हरियाणा का राजकीय पशु है ?",
            "हरियाणा का राजकीय पक्षी है ?",
            "भारत के स्वतंत्र होने के पश्चात तक हरियाणा किस प्रान्त का भाग था ?",
            "हरियाणा का कौन सा स्थान अग्रेयगण की राजधानी थी ?",
            "महाभारत का युद्ध हरियाणा में किस स्थान पर लड़ा गया था ?",
            "अप्रैल, 1919 में गाँधी जी हरियाणा में कहाँ से गिरफ्तार हुए थे ?",
            "हरियाणा के उत्तर में निम्नलिखित में से कौन सा प्रदेश स्थित है ?",
            "हरियाणा के पशिचम में निम्नलिखित में से कौन सा प्रदेश स्थित है ?",
            "हरियाणा की सबसे प्राचीन व प्रमुख नहर कौन सी है ?",
            "हरियाणा के किस भाग में वर्षा अधिक होती है ?",
            "हरियाणा के किस भाग में शिवालिक पर्वत श्रेणियां स्थित हैं ?",
            "हरियाणा में भिवानी नहर किस नहर से निकाली गई है ?",
            "हरियाणा की प्रसिद्ध बड़खल झील का निर्माण कब किया गया था ?",
            "प्रसिद्ध बड़खल झील हरियाणा के किस जिले में स्थित है ?",
            "हरियाणा प्रदेश के किस जिले में सबसे ज्यादा वन हैं ?",
            "जिला रोहतक में निम्नलिखित में से कौन-सा खनिज पदार्थ पाया जाता है ?",
            "कुरुक्षेत्र में किस स्थान पर गन्ना मिल है ?",
            "हरियाणा की जवाहर लाल नेहरू किस नहर से निकली गई है ?",
            "एशिया का सबसे बड़ा पशु-फॉर्म हरियाणा में कहाँ स्थित है ?",
            "हरियाणा की किस नस्ल की भैंस सारे भारत में प्रसिद्ध है ?",
            "गुरुगांव के अतिरिक्त किस जिले में गुड़गावं नहर द्वारा सिंचाई की जाती है ?",
            "हरियाणा ने शराबबंदी कानून कब लागू किया गया था ?",
            "पंचवटी नामक तीर्थस्थल कहा पर स्थित है ?",
            "राजघाट गुरुद्वारा हरियाणा में कहाँ पर स्थित है ?",
            "महर्षि दयानन्द विश्वविद्यालय हरियाणा के किस नगर में स्थित है ?",
            "चौधरी चरण सिंह कृषि विश्वविद्यालय प्रदेश के किस नगर में स्थित है ?",
            "प्रदेश के किस जिले की साक्षरता दर सबसे कम है ?",
            "फरीदाबाद जिले में किस स्थान पर तीन सौ वर्ष पुरानी एक सराय स्थित है ?",
            "गऊकर्ण नामक तालाब किस जिले में स्थित है ?",
            "गोहाना नामक ऐतिहासिक कस्बा हरियाणा के किस जिले में स्थित है ?",
            "निम्न में से कौन वर्ष 2016 में हरियाणा का वाँ जिला बना है ?",
            "ग्यारह रुद्री शिव मंदिर हरियाणा के किस नगर में स्थित है ?",
            "हरियाणा प्रदेश में पुरुषों द्वारा पहनी जाने वाली पगड़ी क्या कहलाती है ?",
            "निम्नलिखित में से भारतीय क्रिकेट का कौन सा सर्वप्रमुख खिलाडी हरियाणा से संबंधित है ?",
            "हरियाणा की प्रसिद्ध महिला खिलाडी गीता जुत्शी किस खेल से संबंधित है ?",
            "हरियाणा के खिलाडी सतीश कुमार का संबंध किस खेल से है ?",
            "हाल ही में कौन सा खिलाड़ी गौतम गंभीर को पछाड़कर सर्वाधिक अर्धशतक लगाने वाला खिलाड़ी बना है?",
            "निम्नलिखित में से किस दिन पूरे विश्व में अंतर्राष्ट्रीय नस्लीय भेदभाव उन्मूलन दिवस मनाया गया?",
            "जेट एयरवेज के संस्थापक और चेयरमैन का क्या नाम है जिन्होंने हाल ही में पद से इस्तीफ़ा दे दिया है?",
            "निम्नलिखित में से किसे हाल ही में फिल्मफेयर पुरस्कार 2019 में सर्वश्रेष्ठ अभिनेत्री का पुरस्कार मिला है?",
            "न्यू वर्ल्ड वेल्थ रिपोर्ट के मुताबिक, 2017 में भारत सबसे धनी देशों की सूची में कोनसे स्थान पर था।",
            "सिक्किम के बाद, जो उत्तर-पूर्व राज्य को आधिकारिक तौर पर ओपन डेफिकेशन फ्री (ओडीएफ) घोषित किया गया है?",
            "पहली महिला वकील का नाम दें जिसे सीधे भारत के सुप्रीम कोर्ट के न्यायाधीश के रूप में पदोन्नत किया गया है?",
            "बहु-पार्श्व व्यापार निकाय को पुनर्जीवित करने के लिए 2018 में WTO सदस्यों की मिनी मिनिस्ट्रील बैठक की मेजबानी करने वाला कौन सा देश?",
            "केकेआर और कंपनी भारत की पहली विदेशी स्वामित्व वाली संपत्ति पुनर्निर्माण कंपनी (एआरसी) बन गई है। यह किस देश से जुड़ा हुआ है?",
            "किस देश ने दुनिया की सबसे बड़ी मानव जीनोम शोध परियोजना शुरू की है?",
            "किस केंद्रीय मंत्री ने एक नया स्टार्ट-अप ऊष्मायन केंद्र लॉन्च किया है। मंगलुरु में उद्यमिता अवसर और शिक्षण केंद्र (सीईओएल)?",
            "किस कंपनी ने 2018 खेलो इंडिया स्कूल गेम्स (केआईएसजी) के प्रसारण अधिकार प्राप्त किए हैं?",
            "किस क्रिकेट टीम ने 2017 रणजी ट्रॉफी टूर्नामेंट जीता है",
            "चेमेरा बांध किस राज्य / संघ राज्य में स्थित है",
            "32 वें सूरजकुंड अंतर्राष्ट्रीय शिल्प मेले के लिए कौन सा राज्य विषय राज्य होगा?",
            "कौन सा कंटेनर पोर्ट 2017 \"समुद्र मंत्र - देखभाल संगठन का वर्ष\" पुरस्कार जीता है?",
            "इंडिया इंफ्रास्ट्रक्चर फाइनेंस कंपनी लिमिटेड (आईआईएफसीएल) के प्रबंध निदेशक (एमडी) के रूप में किसने आरोप लगाया है?",
            "राधा विश्वनाथन, प्रसिद्ध गायक का निधन हो गया है। वह किस राज्य से सम्मानित हुई?",
            "राष्ट्रीय क्रिकेट अकादमी (एनसीए) के नए चीफ ऑपरेटिंग ऑफिसर (सीओओ) के रूप में किसने आरोप लगाया है?",
            "तेलंगाना सरकार ने हाल ही में अनुसूचित जाति / अनुसूचित जनजाति आयोग का गठन किया है। आयोग का मुखिया कौन होगा?",
            "केंद्रीय मंत्रिमंडल ने हाल ही में प्रधान मंत्री स्वास्थ्य सुरक्षा योजना के तहत राज्य में नई एम्स की स्थापना के लिए अपनी मंजूरी दे दी है?",
            "प्रधान मंत्री की आधिकारिक वेबसाइट - www.pmindia.gov.in - कितनी भाषाओं में उपलब्ध है?",
            "नागरिकों के राष्ट्रीय रजिस्टर (एनआरसी) का पहला मसौदा किस राज्य के लिए जारी किया गया है?",
            "नए उप राष्ट्रीय सुरक्षा सलाहकार (एनएसए) के रूप में नियुक्त किया गया है?",
            "बीरबल साहनी इंस्टीट्यूट ऑफ पालेबोटनी (बीएसआईपी) किस राज्य में स्थित है?",
            "वह राज्य जहां ‘’ऑरेंज फेस्टिवल’’ का आयोजन किया गया?",
            "किसानो को 24 घंटे मुफ्त बिजली आपूर्ति करने वाला देश का प्रथम राज्य है?",
            "26 जनवरी 2018 को देश ने कौन – सा गणतन्त्र दिवस मनाया?",
            "2018 साहित्य और शिक्षा के क्षेत्र मे पद्म विभूषण से किसे सम्मानित किया गया?",
            "ऑस्ट्रेलिया ओपन टूर्नामेंट 2018 का पुरुष एकल का खिताब किसने जीता?",
            "फरवरी 2018 मे अंतर्राष्ट्रीय पक्षी महोत्सव कहाँ आयोजित किया",
            "देश के पहले खादी हाट का उदघाटन कहाँ किया गया?",
            "निम्न मे से किस राज्य ने भावांतर भरपाई योजना चालू की है?",
            "हाल ही मे फायर फेस्टिवल कहाँ मनाया गया?",
            "विश्व हिन्दी दिवस कब मनाया जाता है?",
    };

    private String mChoices [][] = {
            {"सभी से","ब्रह्मावर्त प्रदेश", "ब्रह्मा की उत्तरवेदी", " ब्रह्मर्षि प्रदेश", },
            {"1 नवंबर 1966", "1 नवंबर 1967", "1 नवंबर 1968", "1 नवंबर 1969"},
            {"19", "20", "22", "24"},
            {"53", "71", "80", "44"},
            {"बीरेंद्र नारायण चक्रवर्ती", "रणजीत सिंह नरूला", "महावीर प्रसाद", "धरम वीरा"},
            {"राव बिरेन्द्र सिंह", "भगवत दयाल शर्मा", "बंसीलाल", "बनारसी दास गुप्ता"},
            {"19 वाँ", "20 वाँ", "21 वाँ", "22 वाँ"},
            {"सिरसा", "अम्बाला", "करनाल", "कुरुक्षेत्र"},
            {"हिसार", "फरीदाबाद", "भिवानी", "सिरसा"},
            {"यमुनानगर", "महेंद्रगढ़", "कुरुक्षेत्र", "पंचकुला"},
            {"15 वाँ", "12 वाँ", "18 वाँ", "17 वाँ"},
            {"कुश्ती", "कैरम", "चेस", "शतरंग"},
            {"घोडा", "कला मृग", "खरगोश", "वानर"},
            {"कौवा", "हंस", "उल्लु", "कला तीतर"},
            {"पंजाब", "दिल्ली", "राजस्थान", "उत्तर प्रदेश"},
            {"रेवाड़ी", "अग्रोहा", "भिवानी", "सिरसा"},
            {"पानीपत", "सिरसा", "करनाल", "कुरुक्षेत्र"},
            {"पलवल", "रेवाड़ी", "सिरसा", "पानीपत"},
            {"पंजाब", "हिमाचल प्रदेश", "राजस्थान", "उत्तर प्रदेश"},
            {"पंजाब", "हिमाचल प्रदेश", "राजस्थान", "उत्तर प्रदेश"},
            {"गुड़गांव नहर", "भाखड़ा नहर", "भिवानी नहर", "पश्चिमी यमुना नहर"},
            {"दक्षिण-पश्चिम भाग", "उत्तरी-पश्चिमी भाग", "उत्तरी-पूर्वी भाग", "दक्षिणी-पश्चिमी भाग"},
            {"उत्तरी-पूर्वी", "दक्षिणी-पूर्वी", "दक्षिणी-पश्चिमी", "उत्तर-पश्चिमी"},
            {"पूर्वी यमुना नहर से", "पश्चिमी यमुना नहर से", "गुड़गांव नहर से", "भाखड़ा नहर से"},
            {"वर्ष 1940 में", "वर्ष 1947 में", "वर्ष 1943 में", "वर्ष 1949 में"},
            {"रोहतक", "करनाल", "रेवाड़ी", "फरीदाबाद"},
            {"हिसार", "पानीपत", "रेवाड़ी", "यमुनानगर"},
            {"चूना", "मैंगनीज", "अभ्रक", "तांबा"},
            {"बबैन", "शाहबाद मारकण्डा", "लाडवा", "पेहवा"},
            {"भिवानी नहर से", "यमुना नहर से", "भाखड़ा नहर से", "गुड़गांव नहर से"},
            {"रोहतक", "जिन्द", "पंचकुला", "हिसार"},
            {"तुरा", "मुर्रा", "पुस्प", "चस्सा"},
            {"फरीदाबाद", "सोनीपत", "कैथल", "पानीपत"},
            {"1 मई 1997 में", "1 जुलाई 1996 में", "1 जून 1993 में", "1 दिसंबर 1991 में"},
            {"होडल में", "बल्ल्भगढ़ में", "पलवल में", "हथीन में"},
            {"यमुनानगर में", "भिवानी में", "कैथल में", "कुरुक्षेत्र में"},
            {"भिवानी", "रोहतक", "हिसार", "फरीदाबाद"},
            {"जींद", "कुरुक्षेत्र", "गुरुग्राम", "हिसार"},
            {"कैथल", "पानीपत", "नूंह", "करनाल"},
            {"जौनपुर", "बल्लभगढ़", "हथीन", "गांव सराय ख्वाजा"},
            {"रेवाड़ी", "रोहतक", "सोनीपत", "झज्जर"},
            {"पानीपत", "हिसार", "सोनीपत", "रोहतक"},
            {"तोशाम", "बादड़ा", "चरखी दादरी", "लोहारू"},
            {"कैथल", "पानीपत", "सोनीपत", "हिसार"},
            {"खंडवा", "पगड़ी", "तोडा", "पग्गड़"},
            {"अजय जडेजा", "अजहरुद्दीन", "सुनील गावस्कर", "कपिल देव"},
            {"जिमनास्टिक", "दौड़", "टेनिस", "बैडमिंटन"},
            {"हैंडबाल", "क्रिकेट", "हॉकी", "जुङो"},
            {"डेविड वॉर्नर", "विराट कोहली", "ऋषभ पंत", "डेविड मुलर"},
            {"21 मार्च", "20 मार्च", "25 मार्च", "28 मार्च"},
            {"देवेन्द्र पठानिया", "अमित बर्मन", "सिद्धार्थ रॉय", "नरेश गोयल"},
            {"दीपिका पादुकोण", "आलिया भट्ट", "सारा अली खान", "प्रियंका चोपड़ा"},
            {"पांचवां (5th)", "छठा (6th)", "सांतवा (7th)", "आठवा (8th)"},
            {"मणिपुर", "नगालैंड", "अरुणाचल प्रदेश", "मिजोरम"},
            {"एम फातिमा बीवी", "इंदु मल्होत्रा", "आर बनुमाथी", "लीला सेठ"},
            {"इजराइल", "अर्जेंटीना", "इंडिया", "अमेरिका"},
            {"इजराइल", "अमेरिका", "जर्मनी", "अर्जेंटीना"},
            {"चीन", "जर्मनी", "इजराइल", "अमेरिका"},
            {"अरुण जेटली", "निर्मला सीतारमण", "प्रकाश जावड़ेकर", "रविशंकर प्रसाद"},
            {"सहारा", "रिबॉक", "एडिडास", "स्टार स्पोर्ट्स"},
            {"हैदराबाद", "गुजरात", "छत्तीसगढ़", "विदर्भ"},
            {"हिमाचल प्रदेश", "पुडुचेरी", "झारखंड", "उत्तर प्रदेश"},
            {"हरयाणा", "गुजरात", "झारखंड", "उत्तर प्रदेश"},
            {"हल्दिया पोर्ट", "जवाहरलाल नेहरू पोर्ट", "कोलकाता बंदरगाह", "विशाखापत्तनम पोर्ट"},
            {"पंकज जैन", "श्रीधर कुमार", "अरुण के शाह", "टी एस जोशी"},
            {"केरल", "तमिलनाडु", "झारखंड", "कर्नाटक"},
            {"राहुल जोहरी", "तुफान घोष", "सबा करीम", "एमवी श्रीधर"},
            {"चिलाकामाररी नरसिम्हा", "बॉयला विद्यासागर", "एम रामबल नाइक", "एरोलला श्रीनिवास"},
            {"गुजरात", "झारखंड", "छत्तीसगढ़", "हिमाचल प्रदेश"},
            {"10", "12", "13", "15"},
            {"असम", "झारखंड", "पंजाब", "छत्तीसगढ़"},
            {"मनीष पांडे", "अरविंद गुप्ता", "राजिंदर खन्ना", "निखिल सिंह"},
            {"उत्तर प्रदेश", "गुजरात", "हरयाणा", "तमिलनाडु"},
            {"गुजरात", "हरयाणा", "अरुणाचल प्रदेश", "तमिलनाडु"},
            {"केरल", "हरयाणा", "गुजरात", "तेलंगाना"},
            {"68 वां", "69 वां", "71 वां", "72 वां"},
            {"पी. परमेश्वरन", "गुलाम मुस्तफा", "इलयाराजा", "वेध प्रकाश नन्दा"},
            {"ओलिवर", "रोजर फेडरर", "रॉबर्ट", "गेबरीला"},
            {"मध्यप्रदेश", "उत्तराखंड", "पंजाब", "उत्तरप्रदेश"},
            {"पंजाब", "उत्तरप्रदेश", "दिल्ली", "हरयाणा"},
            {"हरयाणा", "पंजाब", "उत्तरप्रदेश", "मध्यप्रदेश"},
            {"चीन", "इटली", "मलेशिया", "जापान"},
            {"9 जनवरी", "10 जनवरी", "ccc", "vvv"},
    };

    private String mCorrectAnswers[] = {"सभी से", "1 नवंबर 1966","22", "71","धरम वीरा", "भगवत दयाल शर्मा","21 वाँ",
            "सिरसा", "फरीदाबाद", "पंचकुला", "18 वाँ","कुश्ती", "कला मृग", "कला तीतर", "पंजाब","अग्रोहा", "कुरुक्षेत्र", "पलवल",
            "हिमाचल प्रदेश","पंजाब", "पश्चिमी यमुना नहर", "उत्तरी-पूर्वी भाग", "उत्तरी-पूर्वी","भाखड़ा नहर से", "वर्ष 1947 में", "फरीदाबाद",
            "यमुनानगर","चूना","शाहबाद मारकण्डा","भाखड़ा नहर से","हिसार","मुर्रा","फरीदाबाद","1 जुलाई 1996 में","पलवल में","कुरुक्षेत्र में",
            "रोहतक","हिसार","नूंह","गांव सराय ख्वाजा",
            "रोहतक","रोहतक","चरखी दादरी","कैथल","खंडवा","कपिल देव","दौड़","जुङो","डेविड वॉर्नर", "21 मार्च", "नरेश गोयल", "आलिया भट्ट",
            "छठा (6th)", "अरुणाचल प्रदेश", "इंदु मल्होत्रा", "इंडिया","अमेरिका", "चीन", "निर्मला सीतारमण", "स्टार स्पोर्ट्स","विदर्भ", "हिमाचल प्रदेश", "उत्तर प्रदेश", "जवाहरलाल नेहरू पोर्ट",
            "पंकज जैन", "कर्नाटक", "तुफान घोष", "एरोलला श्रीनिवास","हिमाचल प्रदेश", "13", "असम", "राजिंदर खन्ना","उत्तर प्रदेश", "अरुणाचल प्रदेश", "तेलंगाना",
            "69 वां", "पी. परमेश्वरन", "रोजर फेडरर", "उत्तरप्रदेश","दिल्ली", "हरयाणा", "जापान", "10 जनवरी"};

    public String getQuestion(int a) {
        String question = mQuestions[a];
        return question;
    }


    public String getChoice1(int a) {
        String choice0 = mChoices[a][0];
        return choice0;
    }


    public String getChoice2(int a) {
        String choice1 = mChoices[a][1];
        return choice1;
    }

    public String getChoice3(int a) {
        String choice2 = mChoices[a][2];
        return choice2;
    }

    public String getChoice4(int a) {
        String choice3 = mChoices[a][3];
        return choice3;
    }

    public String getCorrectAnswer(int a) {
        String answer = mCorrectAnswers[a];
        return answer;
    }

}
