package studio.goldenapp.hr_d;

public class ReasoningQuestions {

    public String mQuestions [] = {
            "जैसे किसी गाय के लिए बछड़ा है, वैसे ही किसी बकरी के लिए है ?",
            "'मछली' जैसे जल से सम्बन्धित है, वैसे ही 'चिड़िया' किससे सम्बन्धित है ?",
            "'जहाज' जैसे 'कप्तान' से सम्बन्धित है, वैसे ही 'अखबार' किससे सम्बन्धित है ?",
            "मोची : चमड़ा : : दर्जी : ?",
            "पोशाक : दर्जी : : ? : बढ़ई",
            "पुस्तक : शेल्फ : : कपड़े :",
            "निम्नलिखित शब्दों में से विषम शब्द चुनिए ?",
            "निम्नलिखित शब्दों में से विषम शब्द चुनिए ?",
            "निम्नलिखित शब्दों में से विषम शब्द चुनिए ?",
            "निम्नलिखित शब्दों में से विषम शब्द चुनिए ?",
            "धन : दुरूपयोग : : लेखन : ?",
            "समाचार-पत्र : पाठक : : रोटी : ?",
            "आशावादी : प्रसन्न : : निराशावादी : ?",
            "निम्नलिखित शब्दों में से विषम शब्द चुनिए ?",
            "एक महिला की ओर संकेत करते हुए साइमन ने कहा, \" वह मेरे पिता की एकमात्र बहन की पुत्री है ।\" वह महिला साइमन से किस प्रकार सम्बन्धित है ?",
            "C माता है A और B की । यदि D पति है B, का तो C कौन है D की ?",
            "A की माँ B की बहन है और C की बेटी है । Dबेटी है B की और बहन है E की, तो C का E से क्या सम्बन्ध है ?",
            "विषाणु : चेचक : : जीवाणु : ?",
            "घर : रसोई : : पौधा : ?",
            "यदि विगत परसों से एक दिन पहले का दिन शनिवार से तीन दिन आगे आने वाला दिन हो, तो आज कौन-सा दिन है ?",
            "यदि 1 जनवरी को शुक्रवार है तो किसी अधिवर्ष में माह की पहली तारीख को कौन-सा दिन होगा ?",
            "यदि परसों शुक्रवार था, तो आगामी परसों के बाद तीसरा दिन क्या होगा ?",
            "यदि 15 सितंबर 2000 शुक्रवार है, तो 15 सितंबर 2001 को कौन-सा दिन होगा ?",
            "'विश्व पर्यावरण दिवस' किस दिन मनाया जाता है ?",
            "अक्षरों ACER में से हरेक अक्षर का एक-एक बार प्रयोग करते हुए अंग्रेजी के कितने अर्थपूर्ण शब्द बनाए जा सकते हैं ?",
            "उत्तराभिमुख बच्चों की एक पंक्ति में, रितेश बाएं छोर से बारहवां है । सुधीर जो दाएं छोर से बाईसवां है, रितेश से दाएं का चौथा है, पंक्ति में कुल कितने बच्चे हैं ?",
            "एक खास कोड में RAIL को 5796 लिखा जाता है और TAPE को 3748 लिखा जाता है, उस कोड में PAIR को कैसे लिखा जाता है ?",
            "निम्नलिखित पांच में चार किसी प्रकार समान हैं इसलिए उनका एक समूह बनता है, वह एक कौन सा है जो इस समूह में नहीं आता है ?",
            "निम्नलिखित में से विषम शब्द चुनिए ?",


    };


    private String mChoices [][] = {
            {"बछेड़ा", "पिल्ला", "छौना", "मेमना"},
            {"आकाश", "वायु", "भोजन", "जल"},
            {"प्रकाशक", "सम्पादक", "पाठक", "मुद्रक"},
            {"बजाज", "कमीज", "धागा", "कपड़ा"},
            {"चमड़ा", "लकड़ी", "फर्नीचर", "कपड़ा"},
            {"कबर्ड", "वॉर्डराब", "ब्युरो", "हैंगर"},
            {"पत्र", "स्पीड पोस्ट", "एस एम एस", "मनी ऑर्डर"},
            {"वर्ग फीट", "वर्गमूल", "वर्ग इंच", "वर्ग मीटर"},
            {"नाक", "होंठ", "आँखे", "गला"},
            {"महासागर", "कुआँ", "टैंक", "होंठ"},
            {"साहित्यिक चोरी", "धोखा", "चोरी", "अशुद्धि"},
            {"बेकर", "उपभोक्ता", "खरीदार", "गेहूँ"},
            {"स्वार्थी", "निकृष्ट", "नगण्य", "उदास"},
            {"इलैक्ट्रिक गिटार", "माउथ आर्गन", "सोनाटा", "की-बोर्ड"},
            {"माता", "फुफेरी बहन", "बहन", "बुआ"},
            {"माता", "बुआ", "चाची", "सास"},
            {"माँ", "बहन", "पिता", "नाना या नानी"},
            {"निद्रा रोग", "मलेरिया", "टायफायड", "छोटी माता"},
            {"जड़", "मिट्टी", "तना", "पत्ती"},
            {"बृहस्पतिवार", "शुक्रवार", "मंगलवार", "बुधवार"},
            {"शुक्रवार", "बुधवार", "बृहस्पतिवार", "मंगलवार"},
            {"बृहस्पतिवार", "मंगलवार", "बुधवार", "शुक्रवार"},
            {"शनिवार", "मंगलवार", "शुक्रवार", "बृहस्पतिवार"},
            {"4 मई", "5 जून", "29 मई", "9 जुलाई"},
            {"1", "2", "3", "5"},
            {"35", "36", "37", "34"},
            {"4795", "7495", "5947", "9754"},
            {"गुलाब", "कमल", "चमेली", "गेंदा"},
            {"खाड़ी", "द्वीप", "प्रायद्वीप", "अंतरीप"},
    };



    private String mCorrectAnswers[] = {"मेमना", "आकाश","सम्पादक", "कपड़ा","फर्नीचर", "कबर्ड","एस एम एस", "वर्गमूल","गला", "टैंक"
            ,"साहित्यिक चोरी", "उपभोक्ता","उदास", "की-बोर्ड","फुफेरी बहन", "सास","नाना या नानी", "मलेरिया","जड़", "शुक्रवार","मंगलवार", "शुक्रवार"
            ,"शनिवार", "5 जून","3", "37","4795", "कमल","अंतरीप"
            };




    public String getQuestion(int a) {
        String question = mQuestions[a];
        return question;
    }


    public String getChoice1(int a) {
        String choice0 = mChoices[a][0];
        return choice0;
    }


    public String getChoice2(int a) {
        String choice1 = mChoices[a][1];
        return choice1;
    }

    public String getChoice3(int a) {
        String choice2 = mChoices[a][2];
        return choice2;
    }

    public String getChoice4(int a) {
        String choice3 = mChoices[a][3];
        return choice3;
    }

    public String getCorrectAnswer(int a) {
        String answer = mCorrectAnswers[a];
        return answer;
    }

}
